/* global AppContext */

import VueJsCommonMixin from "Front/Common/VueJsMixin/VueJsCommonMixin.js";

export default {
    // ----------------------------------------------------
    // Mixin
    // ----------------------------------------------------
    mixins: [VueJsCommonMixin],
    // ----------------------------------------------------
    // ローカルコンポーネント
    // ----------------------------------------------------
    components: {
    },
    // ----------------------------------------------------
    // プロパティ
    // ----------------------------------------------------
    props: {
    },
    // ----------------------------------------------------
    // データ
    // ----------------------------------------------------
    data() {
        return {
        };
    },
    // ----------------------------------------------------
    // ライフサイクルフック
    // ----------------------------------------------------
    created() {
    },
    mounted() {
        // ページロード時の処理
        this.processLoad();
    },
    // ----------------------------------------------------
    // メソッド
    // ----------------------------------------------------
    methods: {
        // 初期表示時の処理
        processLoad() {

            this.getAjax().ajax({
                context: this,
                url: AppContext.baseUrl + "/top/load",
                data: AppContext.requestParams
            }).done(function (data, textStatus, jqXHR) {

                // データをバインドする
                this.bindData(data);

            }).fail(() => {

            });
        },
        // VueJsのデータにdataを設定
        bindData(data) {
        }
        // ------------------------------------
        // イベントの定義
        // ------------------------------------
    },
    // ----------------------------------------------------
    // 計算項目
    // ----------------------------------------------------
    computed: {
    }
}
