/* global AppContext */

import VueJsCommonMixin from "Front/Common/VueJsMixin/VueJsCommonMixin.js";

export default {
    // ----------------------------------------------------
    // Mixin
    // ----------------------------------------------------
    mixins: [VueJsCommonMixin],
    // ----------------------------------------------------
    // ローカルコンポーネント
    // ----------------------------------------------------
    components: {
    },
    // ----------------------------------------------------
    // プロパティ
    // ----------------------------------------------------
    props: {
        // 現在ページ
        currentPage: {
            required: true
        },
        // ページサイズ
        pageSize: {
            required: true
        },
        // 合計件数
        totalCount: {
            required: true
        },
        // ページリスト
        pageList: {
            type: Array,
            required: true
        }
    },
    // ----------------------------------------------------
    // データ
    // ----------------------------------------------------
    data() {
        return {
        };
    },
    // ----------------------------------------------------
    // ライフサイクルフック
    // ----------------------------------------------------
    created() {
    },
    mounted() {
    },
    // ----------------------------------------------------
    // メソッド
    // ----------------------------------------------------
    methods: {
        // ------------------------------------
        // イベントの定義
        // ------------------------------------
        /**
         * ページ番号による検索処理。
         * @param {String} pageNum ページ番号
         * @returns {undefined}
         */
        onSearchByPager(pageNum) {
            this.$emit('search', pageNum);
        }
    },
    // ----------------------------------------------------
    // 計算項目
    // ----------------------------------------------------
    computed: {
    }
}
