/* global AppContext */

import VueJsCommonMixin from "Front/Common/VueJsMixin/VueJsCommonMixin.js";

export default {
    // ----------------------------------------------------
    // Mixin
    // ----------------------------------------------------
    mixins: [VueJsCommonMixin],
    // ----------------------------------------------------
    // ローカルコンポーネント
    // ----------------------------------------------------
    components: {
    },
    // ----------------------------------------------------
    // プロパティ
    // ----------------------------------------------------
    props: {
    },
    // ----------------------------------------------------
    // データ
    // ----------------------------------------------------
    data() {
        return {
        };
    },
    // ----------------------------------------------------
    // ライフサイクルフック
    // ----------------------------------------------------
    created() {
    },
    mounted() {
    },
    // ----------------------------------------------------
    // メソッド
    // ----------------------------------------------------
    methods: {
        // ------------------------------------
        // イベントの定義
        // ------------------------------------
        // DBキャッシュクリア
        onDebugDBCacheClear: function () {

            this.getAjax().ajax({
                context: this,
                url: AppContext.baseUrl + "/debug/cacheClear/dbCacheClear",
                data: AppContext.$requestParams
            }).done(function (data, textStatus, jqXHR) {

                if (data.error === null) {
                    this.getAlertComponent().showInfo(
                            "DBキャッシュクリア成功",
                            "正常にDBのキャッシュがクリアされました。"
                            );
                } else {
                    this.getAlertComponent().showError(
                            "DBキャッシュクリア失敗",
                            data.error
                            );
                }

            }).catch(function () {

            });

            return false;
        }
    },
    // ----------------------------------------------------
    // 計算項目
    // ----------------------------------------------------
    computed: {
    }
}
